
station_coordinate = {'富锦路': '121.424661,31.392260',
 '友谊西路': '121.427953,31.381296',
 '宝安公路': '121.430914,31.369555',
 '共富新村': '121.434063,31.355082',
 '呼兰路': '121.437711,31.339703',
 '通河新村': '121.441546,31.331130',
 '共康路': '121.447063,31.318936',
 '彭浦新村': '121.448642,31.306604',
 '汶水路': '121.450251,31.292556',
 '上海马戏城': '121.452023,31.279895',
 '延长路': '121.455329,31.271675',
 '中山北路': '121.459204,31.258891',
 '上海火车站': '121.457939,31.249632',
 '汉中路': '121.458699,31.241883',
 '新闸路': '121.468151,31.238373',
 '人民广场': '121.475137,31.232781',
 '黄陂南路': '121.473306,31.222745',
 '陕西南路': '121.458744,31.215150',
 '常熟路': '121.449141,31.213524',
 '衡山路': '121.446424,31.204528',
 '徐家汇': '121.436837,31.195338',
 '上海体育馆': '121.437423,31.182813',
 '漕宝路': '121.433143,31.168344',
 '上海南站': '121.430041,31.154579',
 '锦江乐园': '121.414107,31.142217',
 '莲花路': '121.402910,31.130900',
 '外环路': '121.393020,31.120899',
 '莘庄': '121.385373,31.111152',
 '徐泾东': '121.299204,31.188367',
 '虹桥火车站': '121.318910,31.193987',
 '虹桥2号航站楼': '121.326300,31.194211',
 '淞虹路': '121.359588,31.218212',
 '北新泾': '121.373998,31.216395',
 '威宁路': '121.387285,31.214870',
 '娄山关路': '121.404058,31.211158',
 '中山公园': '121.415773,31.217948',
 '江苏路': '121.430642,31.220411',
 '静安寺': '121.446221,31.223083',
 '南京西路': '121.459971,31.229853',
 '南京东路': '121.484628,31.238101',
 '陆家嘴': '121.502262,31.238195',
 '东昌路': '121.515556,31.233270',
 '世纪大道': '121.527213,31.228682',
 '上海科技馆': '121.544439,31.218820',
 '世纪公园': '121.550909,31.209421',
 '龙阳路': '121.557634,31.203575',
 '张江高科': '121.587687,31.201832',
 '金科路': '121.601989,31.204213',
 '广兰路': '121.621072,31.211050',
 '唐镇': '121.656269,31.214107',
 '创新中路': '121.673713,31.213871',
 '华夏东路': '121.680972,31.196575',
 '川沙': '121.698210,31.186741',
 '凌空路': '121.724095,31.192861',
 '远东大道': '121.755301,31.199385',
 '海天三路': '121.796878,31.168459',
 '浦东国际机场': '121.806436,31.149596',
 '石龙路': '121.443205,31.157949',
 '龙漕路': '121.444383,31.169458',
 '漕溪路': '121.438410,31.176746',
 '宜山路': '121.427194,31.186717',
 '虹桥路': '121.420814,31.197524',
 '延安西路': '121.417062,31.209616',
 '金沙江路': '121.413150,31.232004',
 '曹杨路': '121.417701,31.239302',
 '镇坪路': '121.429779,31.246369',
 '中潭路': '121.441001,31.254568',
 '宝山路': '121.476298,31.251523',
 '东宝兴路': '121.480202,31.259886',
 '虹口足球场': '121.479154,31.271392',
 '赤峰路': '121.482429,31.281247',
 '大柏树': '121.483216,31.289433',
 '江湾镇': '121.485064,31.305566',
 '殷高西路': '121.484856,31.320005',
 '长江南路': '121.491482,31.332062',
 '淞发路': '121.500390,31.345135',
 '张华浜': '121.498671,31.358016',
 '淞滨路': '121.492818,31.370928',
 '水产路': '121.488247,31.381302',
 '宝杨路': '121.479574,31.395315',
 '友谊路': '121.475924,31.404016',
 '铁力路': '121.461139,31.408120',
 '江杨北路': '121.439819,31.407858',
 '海伦路': '121.488697,31.259303',
 '临平路': '121.500696,31.260874',
 '大连路': '121.513088,31.257938',
 '杨树浦路': '121.517210,31.251935',
 '浦东大道': '121.519385,31.239974',
 '浦电路': '121.529122,31.220104',
 '蓝村路': '121.527627,31.211672',
 '塘桥': '121.518690,31.209762',
 '南浦大桥': '121.499725,31.208504',
 '西藏南路': '121.489555,31.201967',
 '鲁班路': '121.475148,31.199221',
 '大木桥路': '121.463278,31.194057',
 '东安路': '121.454897,31.190819',
 '上海体育场': '121.443529,31.185605',
 '春申路': '121.385818,31.098250',
 '银都路': '121.390264,31.089345',
 '颛桥': '121.401868,31.067013',
 '北桥': '121.410054,31.045112',
 '剑川路': '121.416582,31.026483',
 '东川路': '121.419901,31.018197',
 '江川路': '121.423474,31.005428',
 '西渡': '121.432441,30.989350',
 '肖塘': '121.441857,30.965888',
 '奉浦大道': '121.448984,30.942055',
 '环城东路': '121.463204,30.931168',
 '望园路': '121.483580,30.931940',
 '金海湖': '121.492506,30.928805',
 '奉贤新城': '121.496290,30.913916',
 '金平路': '121.410186,31.011282',
 '华宁路': '121.395255,31.007467',
 '文井路': '121.380775,31.003597',
 '闵行开发区': '121.369712,31.000627',
 '港城路': '121.574752,31.353005',
 '外高桥保税区北': '121.586926,31.347802',
 '航津路': '121.593974,31.335371',
 '外高桥保税区南': '121.601963,31.321578',
 '洲海路': '121.589396,31.312229',
 '五洲大道': '121.589212,31.302569',
 '东靖路': '121.588736,31.290684',
 '巨峰路': '121.588365,31.280684',
 '五莲路': '121.587866,31.272025',
 '博兴路': '121.586689,31.263520',
 '金桥路': '121.581817,31.257084',
 '云山路': '121.572775,31.250413',
 '德平路': '121.564237,31.245400',
 '北洋泾路': '121.552314,31.239145',
 '民生路': '121.543527,31.235851',
 '源深体育中心': '121.534642,31.233004',
 '上海儿童医学中心': '121.523482,31.203277',
 '临沂新村': '121.516695,31.193202',
 '高科西路': '121.509845,31.185761',
 '东明路': '121.510868,31.172646',
 '高青路': '121.515787,31.159907',
 '华夏西路': '121.514539,31.149878',
 '上南路': '121.506151,31.149030',
 '灵岩南路': '121.495295,31.148665',
 '东方体育中心': '121.480304,31.153366',
 '花木路': '121.562754,31.211212',
 '芳华路': '121.550115,31.193110',
 '锦绣路': '121.540041,31.187592',
 '杨高南路': '121.525087,31.187566',
 '云台路': '121.500439,31.182212',
 '耀华路': '121.494605,31.178513',
 '长清路': '121.487775,31.174452',
 '后滩': '121.473756,31.171918',
 '龙华中路': '121.457054,31.183843',
 '肇嘉浜路': '121.450212,31.199436',
 '昌平路': '121.442617,31.233749',
 '长寿路': '121.438272,31.240860',
 '岚皋路': '121.421939,31.256198',
 '新村路': '121.422682,31.263952',
 '大华三路': '121.422949,31.274047',
 '行知路': '121.421493,31.284942',
 '大场镇': '121.416548,31.293320',
 '场中路': '121.413661,31.303685',
 '上大路': '121.408580,31.315071',
 '南陈路': '121.398863,31.321437',
 '上海大学': '121.388884,31.320586',
 '祁华路': '121.373569,31.322315',
 '顾村公园': '121.373009,31.344594',
 '刘行': '121.362376,31.357586',
 '潘广路': '121.355845,31.364182',
 '罗南新村': '121.357470,31.388831',
 '美兰湖': '121.349966,31.401949',
 '沈杜公路': '121.512272,31.061427',
 '联航路': '121.510594,31.073567',
 '江月路': '121.508603,31.084253',
 '浦江镇': '121.506272,31.096590',
 '芦恒路': '121.497842,31.119015',
 '凌兆新村': '121.489663,31.141301',
 '杨思': '121.493443,31.161054',
 '成山路': '121.496326,31.170511',
 '中华艺术宫': '121.493626,31.185242',
 '陆家浜路': '121.486115,31.211789',
 '老西门': '121.483793,31.219014',
 '大世界': '121.479326,31.227182',
 '曲阜路': '121.471543,31.242307',
 '中兴路': '121.469026,31.253228',
 '西藏北路': '121.468769,31.263505',
 '曲阳路': '121.491138,31.276524',
 '四平路': '121.501488,31.274880',
 '鞍山新村': '121.509685,31.273242',
 '江浦路': '121.518379,31.274946',
 '黄兴路': '121.528401,31.278814',
 '延吉中路': '121.534941,31.288543',
 '黄兴公园': '121.533383,31.295389',
 '翔殷路': '121.531974,31.305002',
 '嫩江路': '121.531954,31.314804',
 '市光路': '121.531933,31.322724',
 '曹路': '121.683046,31.271272',
 '民雷路': '121.668125,31.268335',
 '顾唐路': '121.656465,31.266074',
 '金海路': '121.638629,31.263141',
 '金吉路': '121.628479,31.264309',
 '金桥': '121.611336,31.260850',
 '台儿庄路': '121.597458,31.252825',
 '蓝天路': '121.577978,31.241017',
 '芳甸路': '121.558431,31.231845',
 '杨高中路': '121.548664,31.227510',
 '商城路': '121.516275,31.230258',
 '小南门': '121.498398,31.216866',
 '马当路': '121.477256,31.209520',
 '打浦桥': '121.468681,31.206309',
 '嘉善路': '121.460704,31.202820',
 '桂林路': '121.418064,31.174791',
 '漕河泾开发区': '121.397769,31.170644',
 '合川路': '121.384772,31.166542',
 '星中路': '121.368903,31.158109',
 '七宝': '121.349221,31.155287',
 '中春路': '121.337700,31.149415',
 '九亭': '121.319423,31.137252',
 '泗泾': '121.260247,31.118272',
 '佘山': '121.229686,31.104097',
 '洞泾': '121.230473,31.084492',
 '松江大学城': '121.232577,31.053984',
 '松江新城': '121.230739,31.030295',
 '松江体育中心': '121.230546,31.016006',
 '醉白池': '121.229361,31.001125',
 '松江南站': '121.230884,30.984818',
 '新江湾城': '121.506951,31.328496',
 '殷高东路': '121.506797,31.321768',
 '三门路': '121.508340,31.313214',
 '江湾体育场': '121.513314,31.304293',
 '五角场': '121.514632,31.298043',
 '国权路': '121.510024,31.289276',
 '同济大学': '121.506357,31.282086',
 '邮电新村': '121.494362,31.268533',
 '四川北路': '121.484208,31.252035',
 '天潼路': '121.482473,31.243829',
 '豫园': '121.487473,31.227801',
 '新天地': '121.475182,31.216367',
 '上海图书馆': '121.444363,31.207960',
 '交通大学': '121.435253,31.202213',
 '宋园路': '121.412080,31.196540',
 '伊犁路': '121.403899,31.198880',
 '水城路': '121.392259,31.199482',
 '龙溪路': '121.380034,31.194400',
 '上海动物园': '121.368137,31.190246',
 '虹桥1号航站楼': '121.347371,31.191363',
 '龙柏新村': '121.370480,31.176882',
 '紫藤路': '121.364831,31.169674',
 '航中路': '121.355336,31.165417',
 '康新公路': '121.617199,31.130439',
 '秀沿路': '121.598390,31.138128',
 '罗山路': '121.593152,31.153259',
 '御桥': '121.570914,31.158131',
 '三林东': '121.522999,31.146459',
 '浦三路': '121.539005,31.150861',
 '三林': '121.511594,31.143172',
 '云锦路': '121.458519,31.166488',
 '龙华': '121.452958,31.172672',
 '龙耀路': '121.459702,31.159720',
 '上海游泳馆': '121.441424,31.179123',
 '隆德路': '121.423576,31.230509',
 '枫桥路': '121.411402,31.241850',
 '真如': '121.407219,31.250767',
 '上海西站': '121.400926,31.262693',
 '李子园': '121.389969,31.269020',
 '祁连山路': '121.376035,31.271650',
 '武威路': '121.364678,31.276646',
 '桃浦新村': '121.349623,31.281603',
 '南翔': '121.323141,31.296952',
 '马陆': '121.276906,31.319675',
 '嘉定新城': '121.254294,31.330062',
 '白银路': '121.245350,31.345359',
 '嘉定西': '121.227855,31.377107',
 '嘉定北': '121.237350,31.391549',
 '上海赛车场': '121.226098,31.331898',
 '昌吉东路': '121.200384,31.293620',
 '上海汽车城': '121.180742,31.285403',
 '安亭': '121.161985,31.288490',
 '兆丰路': '121.150315,31.289048',
 '光明路': '121.117270,31.296697',
 '花桥': '121.104407,31.298790',
 '申江路': '121.626863,31.280231',
 '金京路': '121.615477,31.279823',
 '杨高北路': '121.602960,31.280092',
 '东陆路': '121.579124,31.282533',
 '复兴岛': '121.561315,31.280779',
 '爱国路': '121.552655,31.279788',
 '隆昌路': '121.544692,31.275213',
 '宁国路': '121.532352,31.268574',
 '江浦公园': '121.523697,31.264570',
 '提篮桥': '121.506801,31.253518',
 '国际客运中心': '121.498158,31.250160',
 '桂林公园': '121.419654,31.166986',
 '虹漕路': '121.410553,31.164033',
 '虹梅路': '121.397250,31.160350',
 '东兰路': '121.391915,31.155823',
 '顾戴路': '121.391856,31.140890',
 '虹莘路': '121.380348,31.137448',
 '七莘路': '121.362464,31.131638',
 '金运路': '121.319308,31.240986',
 '金沙江西路': '121.335156,31.241152',
 '丰庄': '121.355141,31.242553',
 '祁连山南路': '121.367275,31.237625',
 '真北路': '121.381948,31.232235',
 '大渡河路': '121.394431,31.231752',
 '武宁路': '121.430504,31.234346',
 '江宁路': '121.444830,31.244282',
 '自然博物馆': '121.462366,31.236451',
 '淮海中路': '121.464514,31.220280',
 '世博会博物馆': '121.481592,31.197572',
 '世博大道': '121.484313,31.182789',
 '华鹏路': '121.526567,31.176276',
 '下南路': '121.540189,31.179295',
 '北蔡': '121.552017,31.180131',
 '陈春路': '121.557708,31.174756',
 '莲溪路': '121.566414,31.169110',
 '华夏中路': '121.583109,31.175759',
 '中科路': '121.602465,31.178862',
 '学林路': '121.614363,31.183476',
 '张江路': '121.629182,31.189130',
 '周浦东': '121.606895,31.110038',
 '鹤沙航城': '121.611239,31.077797',
 '航头东': '121.617494,31.054919',
 '新场': '121.648980,31.045561',
 '野生动物园': '121.699218,31.050325',
 '惠南': '121.761677,31.053828',
 '惠南东': '121.793800,31.026448',
 '书院': '121.850520,30.959264',
 '临港大道': '121.910851,30.923519',
 '滴水湖': '121.929583,30.907245',
 '褚光路': '121.293040,31.191678',
 '蟠龙路': '121.278645,31.186328',
 '徐盈路': '121.253976,31.178101',
 '徐泾北城': '121.241668,31.175518',
 '嘉松中路': '121.223916,31.164099',
 '赵巷': '121.192279,31.161247',
 '汇金路': '121.151665,31.161221',
 '青浦新城': '121.125670,31.158925',
 '漕盈路': '121.096889,31.160467',
 '淀山湖大道': '121.082134,31.134460',
 '朱家角': '121.048989,31.100594',
 '东方绿舟': '121.019534,31.098544',
 '沈度公路': '121.512272,31.061427',
 '三鲁公路': '121.527389,31.056108',
 '闵瑞路': '121.530323,31.047956',
 '浦航路': '121.530591,31.040993',
 '东城一路': '121.532093,31.030390',
 '汇臻路': '121.524558,31.025245'}

# import stations_information
# # def get_traffic(coordinate):
# station_list = [key for key in stations_information.station_subway.keys()]
# station_coordinate = {station:get_coordinate(station+'(地铁站)','上海') for station in station_list}


station_subway = {'富锦路': '上海地铁1号线',
 '友谊西路': '上海地铁1号线',
 '宝安公路': '上海地铁1号线',
 '共富新村': '上海地铁1号线',
 '呼兰路': '上海地铁1号线',
 '通河新村': '上海地铁1号线',
 '共康路': '上海地铁1号线',
 '彭浦新村': '上海地铁1号线',
 '汶水路': '上海地铁1号线',
 '上海马戏城': '上海地铁1号线',
 '延长路': '上海地铁1号线',
 '中山北路': '上海地铁1号线',
 '上海火车站': '上海地铁1号线|上海地铁3号线|上海地铁4号线',
 '汉中路': '上海地铁1号线|上海地铁12号线|上海地铁13号线',
 '新闸路': '上海地铁1号线',
 '人民广场': '上海地铁1号线|上海地铁2号线|上海地铁8号线',
 '黄陂南路': '上海地铁1号线',
 '陕西南路': '上海地铁1号线|上海地铁10号线|上海地铁10号线支线|上海地铁12号线',
 '常熟路': '上海地铁1号线|上海地铁7号线',
 '衡山路': '上海地铁1号线',
 '徐家汇': '上海地铁1号线|上海地铁9号线|上海地铁11号线|上海地铁11号线支线',
 '上海体育馆': '上海地铁1号线|上海地铁4号线',
 '漕宝路': '上海地铁1号线|上海地铁12号线',
 '上海南站': '上海地铁1号线|上海地铁3号线',
 '锦江乐园': '上海地铁1号线',
 '莲花路': '上海地铁1号线',
 '外环路': '上海地铁1号线',
 '莘庄': '上海地铁1号线|上海地铁5号线',
 '徐泾东': '上海地铁2号线',
 '虹桥火车站': '上海地铁2号线|上海地铁10号线|上海地铁17号线',
 '虹桥2号航站楼': '上海地铁2号线|上海地铁10号线',
 '淞虹路': '上海地铁2号线',
 '北新泾': '上海地铁2号线',
 '威宁路': '上海地铁2号线',
 '娄山关路': '上海地铁2号线',
 '中山公园': '上海地铁2号线|上海地铁3号线|上海地铁4号线',
 '江苏路': '上海地铁2号线|上海地铁11号线|上海地铁11号线支线',
 '静安寺': '上海地铁2号线|上海地铁7号线',
 '南京西路': '上海地铁2号线|上海地铁12号线|上海地铁13号线',
 '南京东路': '上海地铁2号线|上海地铁10号线|上海地铁10号线支线',
 '陆家嘴': '上海地铁2号线',
 '东昌路': '上海地铁2号线',
 '世纪大道': '上海地铁2号线|上海地铁4号线|上海地铁6号线|上海地铁9号线',
 '上海科技馆': '上海地铁2号线',
 '世纪公园': '上海地铁2号线',
 '龙阳路': '上海地铁2号线|上海地铁7号线|上海地铁16号线|上海地铁磁悬浮',
 '张江高科': '上海地铁2号线',
 '金科路': '上海地铁2号线',
 '广兰路': '上海地铁2号线',
 '唐镇': '上海地铁2号线',
 '创新中路': '上海地铁2号线',
 '华夏东路': '上海地铁2号线',
 '川沙': '上海地铁2号线',
 '凌空路': '上海地铁2号线',
 '远东大道': '上海地铁2号线',
 '海天三路': '上海地铁2号线',
 '浦东国际机场': '上海地铁2号线|上海地铁磁悬浮',
 '石龙路': '上海地铁3号线',
 '龙漕路': '上海地铁3号线|上海地铁12号线',
 '漕溪路': '上海地铁3号线',
 '宜山路': '上海地铁3号线|上海地铁4号线|上海地铁9号线',
 '虹桥路': '上海地铁3号线|上海地铁4号线|上海地铁10号线|上海地铁10号线支线',
 '延安西路': '上海地铁3号线|上海地铁4号线',
 '金沙江路': '上海地铁3号线|上海地铁4号线|上海地铁13号线',
 '曹杨路': '上海地铁3号线|上海地铁4号线|上海地铁11号线|上海地铁11号线支线',
 '镇坪路': '上海地铁3号线|上海地铁4号线|上海地铁7号线',
 '中潭路': '上海地铁3号线|上海地铁4号线',
 '宝山路': '上海地铁3号线|上海地铁4号线',
 '东宝兴路': '上海地铁3号线',
 '虹口足球场': '上海地铁3号线|上海地铁8号线',
 '赤峰路': '上海地铁3号线',
 '大柏树': '上海地铁3号线',
 '江湾镇': '上海地铁3号线',
 '殷高西路': '上海地铁3号线',
 '长江南路': '上海地铁3号线',
 '淞发路': '上海地铁3号线',
 '张华浜': '上海地铁3号线',
 '淞滨路': '上海地铁3号线',
 '水产路': '上海地铁3号线',
 '宝杨路': '上海地铁3号线',
 '友谊路': '上海地铁3号线',
 '铁力路': '上海地铁3号线',
 '江杨北路': '上海地铁3号线',
 '海伦路': '上海地铁4号线|上海地铁10号线|上海地铁10号线支线',
 '临平路': '上海地铁4号线',
 '大连路': '上海地铁4号线|上海地铁12号线',
 '杨树浦路': '上海地铁4号线',
 '浦东大道': '上海地铁4号线',
 '浦电路': '上海地铁4号线|上海地铁6号线',
 '蓝村路': '上海地铁4号线|上海地铁6号线',
 '塘桥': '上海地铁4号线',
 '南浦大桥': '上海地铁4号线',
 '西藏南路': '上海地铁4号线|上海地铁8号线',
 '鲁班路': '上海地铁4号线',
 '大木桥路': '上海地铁4号线|上海地铁12号线',
 '东安路': '上海地铁4号线|上海地铁7号线',
 '上海体育场': '上海地铁4号线',
 '春申路': '上海地铁5号线',
 '银都路': '上海地铁5号线',
 '颛桥': '上海地铁5号线',
 '北桥': '上海地铁5号线',
 '剑川路': '上海地铁5号线',
 '东川路': '上海地铁5号线|上海地铁5号线支线',
 '江川路': '上海地铁5号线',
 '西渡': '上海地铁5号线',
 '肖塘': '上海地铁5号线',
 '奉浦大道': '上海地铁5号线',
 '环城东路': '上海地铁5号线',
 '望园路': '上海地铁5号线',
 '金海湖': '上海地铁5号线',
 '奉贤新城': '上海地铁5号线',
 '金平路': '上海地铁5号线支线',
 '华宁路': '上海地铁5号线支线',
 '文井路': '上海地铁5号线支线',
 '闵行开发区': '上海地铁5号线支线',
 '港城路': '上海地铁6号线',
 '外高桥保税区北': '上海地铁6号线',
 '航津路': '上海地铁6号线',
 '外高桥保税区南': '上海地铁6号线',
 '洲海路': '上海地铁6号线',
 '五洲大道': '上海地铁6号线',
 '东靖路': '上海地铁6号线',
 '巨峰路': '上海地铁6号线|上海地铁12号线',
 '五莲路': '上海地铁6号线',
 '博兴路': '上海地铁6号线',
 '金桥路': '上海地铁6号线',
 '云山路': '上海地铁6号线',
 '德平路': '上海地铁6号线',
 '北洋泾路': '上海地铁6号线',
 '民生路': '上海地铁6号线',
 '源深体育中心': '上海地铁6号线',
 '上海儿童医学中心': '上海地铁6号线',
 '临沂新村': '上海地铁6号线',
 '高科西路': '上海地铁6号线|上海地铁7号线',
 '东明路': '上海地铁6号线|上海地铁13号线',
 '高青路': '上海地铁6号线',
 '华夏西路': '上海地铁6号线',
 '上南路': '上海地铁6号线',
 '灵岩南路': '上海地铁6号线',
 '东方体育中心': '上海地铁6号线|上海地铁8号线|上海地铁11号线|上海地铁11号线支线',
 '花木路': '上海地铁7号线',
 '芳华路': '上海地铁7号线',
 '锦绣路': '上海地铁7号线',
 '杨高南路': '上海地铁7号线',
 '云台路': '上海地铁7号线',
 '耀华路': '上海地铁7号线|上海地铁8号线',
 '长清路': '上海地铁7号线|上海地铁13号线',
 '后滩': '上海地铁7号线',
 '龙华中路': '上海地铁7号线|上海地铁12号线',
 '肇嘉浜路': '上海地铁7号线|上海地铁9号线',
 '昌平路': '上海地铁7号线',
 '长寿路': '上海地铁7号线|上海地铁13号线',
 '岚皋路': '上海地铁7号线',
 '新村路': '上海地铁7号线',
 '大华三路': '上海地铁7号线',
 '行知路': '上海地铁7号线',
 '大场镇': '上海地铁7号线',
 '场中路': '上海地铁7号线',
 '上大路': '上海地铁7号线',
 '南陈路': '上海地铁7号线',
 '上海大学': '上海地铁7号线',
 '祁华路': '上海地铁7号线',
 '顾村公园': '上海地铁7号线',
 '刘行': '上海地铁7号线',
 '潘广路': '上海地铁7号线',
 '罗南新村': '上海地铁7号线',
 '美兰湖': '上海地铁7号线',
 '沈杜公路': '上海地铁8号线',
 '联航路': '上海地铁8号线',
 '江月路': '上海地铁8号线',
 '浦江镇': '上海地铁8号线',
 '芦恒路': '上海地铁8号线',
 '凌兆新村': '上海地铁8号线',
 '杨思': '上海地铁8号线',
 '成山路': '上海地铁8号线|上海地铁13号线',
 '中华艺术宫': '上海地铁8号线',
 '陆家浜路': '上海地铁8号线|上海地铁9号线',
 '老西门': '上海地铁8号线|上海地铁10号线|上海地铁10号线支线',
 '大世界': '上海地铁8号线',
 '曲阜路': '上海地铁8号线|上海地铁12号线',
 '中兴路': '上海地铁8号线',
 '西藏北路': '上海地铁8号线',
 '曲阳路': '上海地铁8号线',
 '四平路': '上海地铁8号线|上海地铁10号线|上海地铁10号线支线',
 '鞍山新村': '上海地铁8号线',
 '江浦路': '上海地铁8号线',
 '黄兴路': '上海地铁8号线',
 '延吉中路': '上海地铁8号线',
 '黄兴公园': '上海地铁8号线',
 '翔殷路': '上海地铁8号线',
 '嫩江路': '上海地铁8号线',
 '市光路': '上海地铁8号线',
 '曹路': '上海地铁9号线',
 '民雷路': '上海地铁9号线',
 '顾唐路': '上海地铁9号线',
 '金海路': '上海地铁9号线|上海地铁12号线',
 '金吉路': '上海地铁9号线',
 '金桥': '上海地铁9号线',
 '台儿庄路': '上海地铁9号线',
 '蓝天路': '上海地铁9号线',
 '芳甸路': '上海地铁9号线',
 '杨高中路': '上海地铁9号线',
 '商城路': '上海地铁9号线',
 '小南门': '上海地铁9号线',
 '马当路': '上海地铁9号线|上海地铁13号线',
 '打浦桥': '上海地铁9号线',
 '嘉善路': '上海地铁9号线|上海地铁12号线',
 '桂林路': '上海地铁9号线',
 '漕河泾开发区': '上海地铁9号线',
 '合川路': '上海地铁9号线',
 '星中路': '上海地铁9号线',
 '七宝': '上海地铁9号线',
 '中春路': '上海地铁9号线',
 '九亭': '上海地铁9号线',
 '泗泾': '上海地铁9号线',
 '佘山': '上海地铁9号线',
 '洞泾': '上海地铁9号线',
 '松江大学城': '上海地铁9号线',
 '松江新城': '上海地铁9号线',
 '松江体育中心': '上海地铁9号线',
 '醉白池': '上海地铁9号线',
 '松江南站': '上海地铁9号线',
 '新江湾城': '上海地铁10号线|上海地铁10号线支线',
 '殷高东路': '上海地铁10号线|上海地铁10号线支线',
 '三门路': '上海地铁10号线|上海地铁10号线支线',
 '江湾体育场': '上海地铁10号线|上海地铁10号线支线',
 '五角场': '上海地铁10号线|上海地铁10号线支线',
 '国权路': '上海地铁10号线|上海地铁10号线支线',
 '同济大学': '上海地铁10号线|上海地铁10号线支线',
 '邮电新村': '上海地铁10号线|上海地铁10号线支线',
 '四川北路': '上海地铁10号线|上海地铁10号线支线',
 '天潼路': '上海地铁10号线|上海地铁10号线支线|上海地铁12号线',
 '豫园': '上海地铁10号线|上海地铁10号线支线',
 '新天地': '上海地铁10号线|上海地铁10号线支线|上海地铁13号线',
 '上海图书馆': '上海地铁10号线|上海地铁10号线支线',
 '交通大学': '上海地铁10号线|上海地铁10号线支线|上海地铁11号线|上海地铁11号线支线',
 '宋园路': '上海地铁10号线|上海地铁10号线支线',
 '伊犁路': '上海地铁10号线|上海地铁10号线支线',
 '水城路': '上海地铁10号线|上海地铁10号线支线',
 '龙溪路': '上海地铁10号线|上海地铁10号线支线',
 '上海动物园': '上海地铁10号线',
 '虹桥1号航站楼': '上海地铁10号线',
 '龙柏新村': '上海地铁10号线支线',
 '紫藤路': '上海地铁10号线支线',
 '航中路': '上海地铁10号线支线',
 '康新公路': '上海地铁11号线',
 '秀沿路': '上海地铁11号线',
 '罗山路': '上海地铁11号线|上海地铁11号线支线|上海地铁16号线',
 '御桥': '上海地铁11号线|上海地铁11号线支线',
 '三林东': '上海地铁11号线|上海地铁11号线支线',
 '浦三路': '上海地铁11号线|上海地铁11号线支线',
 '三林': '上海地铁11号线|上海地铁11号线支线',
 '云锦路': '上海地铁11号线|上海地铁11号线支线',
 '龙华': '上海地铁11号线|上海地铁11号线支线|上海地铁12号线',
 '龙耀路': '上海地铁11号线|上海地铁11号线支线',
 '上海游泳馆': '上海地铁11号线|上海地铁11号线支线',
 '隆德路': '上海地铁11号线|上海地铁11号线支线|上海地铁13号线',
 '枫桥路': '上海地铁11号线|上海地铁11号线支线',
 '真如': '上海地铁11号线|上海地铁11号线支线',
 '上海西站': '上海地铁11号线|上海地铁11号线支线',
 '李子园': '上海地铁11号线|上海地铁11号线支线',
 '祁连山路': '上海地铁11号线|上海地铁11号线支线',
 '武威路': '上海地铁11号线|上海地铁11号线支线',
 '桃浦新村': '上海地铁11号线|上海地铁11号线支线',
 '南翔': '上海地铁11号线|上海地铁11号线支线',
 '马陆': '上海地铁11号线|上海地铁11号线支线',
 '嘉定新城': '上海地铁11号线|上海地铁11号线支线',
 '白银路': '上海地铁11号线',
 '嘉定西': '上海地铁11号线',
 '嘉定北': '上海地铁11号线',
 '上海赛车场': '上海地铁11号线支线',
 '昌吉东路': '上海地铁11号线支线',
 '上海汽车城': '上海地铁11号线支线',
 '安亭': '上海地铁11号线支线',
 '兆丰路': '上海地铁11号线支线',
 '光明路': '上海地铁11号线支线',
 '花桥': '上海地铁11号线支线',
 '申江路': '上海地铁12号线',
 '金京路': '上海地铁12号线',
 '杨高北路': '上海地铁12号线',
 '东陆路': '上海地铁12号线',
 '复兴岛': '上海地铁12号线',
 '爱国路': '上海地铁12号线',
 '隆昌路': '上海地铁12号线',
 '宁国路': '上海地铁12号线',
 '江浦公园': '上海地铁12号线',
 '提篮桥': '上海地铁12号线',
 '国际客运中心': '上海地铁12号线',
 '桂林公园': '上海地铁12号线',
 '虹漕路': '上海地铁12号线',
 '虹梅路': '上海地铁12号线',
 '东兰路': '上海地铁12号线',
 '顾戴路': '上海地铁12号线',
 '虹莘路': '上海地铁12号线',
 '七莘路': '上海地铁12号线',
 '金运路': '上海地铁13号线',
 '金沙江西路': '上海地铁13号线',
 '丰庄': '上海地铁13号线',
 '祁连山南路': '上海地铁13号线',
 '真北路': '上海地铁13号线',
 '大渡河路': '上海地铁13号线',
 '武宁路': '上海地铁13号线',
 '江宁路': '上海地铁13号线',
 '自然博物馆': '上海地铁13号线',
 '淮海中路': '上海地铁13号线',
 '世博会博物馆': '上海地铁13号线',
 '世博大道': '上海地铁13号线',
 '华鹏路': '上海地铁13号线',
 '下南路': '上海地铁13号线',
 '北蔡': '上海地铁13号线',
 '陈春路': '上海地铁13号线',
 '莲溪路': '上海地铁13号线',
 '华夏中路': '上海地铁13号线|上海地铁16号线',
 '中科路': '上海地铁13号线',
 '学林路': '上海地铁13号线',
 '张江路': '上海地铁13号线',
 '周浦东': '上海地铁16号线',
 '鹤沙航城': '上海地铁16号线',
 '航头东': '上海地铁16号线',
 '新场': '上海地铁16号线',
 '野生动物园': '上海地铁16号线',
 '惠南': '上海地铁16号线',
 '惠南东': '上海地铁16号线',
 '书院': '上海地铁16号线',
 '临港大道': '上海地铁16号线',
 '滴水湖': '上海地铁16号线',
 '褚光路': '上海地铁17号线',
 '蟠龙路': '上海地铁17号线',
 '徐盈路': '上海地铁17号线',
 '徐泾北城': '上海地铁17号线',
 '嘉松中路': '上海地铁17号线',
 '赵巷': '上海地铁17号线',
 '汇金路': '上海地铁17号线',
 '青浦新城': '上海地铁17号线',
 '漕盈路': '上海地铁17号线',
 '淀山湖大道': '上海地铁17号线',
 '朱家角': '上海地铁17号线',
 '东方绿舟': '上海地铁17号线',
 '沈度公路': '上海地铁17号线|上海地铁浦江线',
 '三鲁公路': '上海地铁17号线|上海地铁浦江线',
 '闵瑞路': '上海地铁17号线|上海地铁浦江线',
 '浦航路': '上海地铁17号线|上海地铁浦江线',
 '东城一路': '上海地铁17号线|上海地铁浦江线',
 '汇臻路': '上海地铁17号线|上海地铁浦江线'}


# import stations_information
# station_subway = dict()
# for (k,v) in stations_information.subway_station.items():
#     for station in v:
#         if station in station_subway:
#             station_subway[station] += '|' + k
#         else:
#             station_subway[station] = k
# station_subway




subway_station = {'上海地铁1号线': ['富锦路',
  '友谊西路',
  '宝安公路',
  '共富新村',
  '呼兰路',
  '通河新村',
  '共康路',
  '彭浦新村',
  '汶水路',
  '上海马戏城',
  '延长路',
  '中山北路',
  '上海火车站',
  '汉中路',
  '新闸路',
  '人民广场',
  '黄陂南路',
  '陕西南路',
  '常熟路',
  '衡山路',
  '徐家汇',
  '上海体育馆',
  '漕宝路',
  '上海南站',
  '锦江乐园',
  '莲花路',
  '外环路',
  '莘庄'],
 '上海地铁2号线': ['徐泾东',
  '虹桥火车站',
  '虹桥2号航站楼',
  '淞虹路',
  '北新泾',
  '威宁路',
  '娄山关路',
  '中山公园',
  '江苏路',
  '静安寺',
  '南京西路',
  '人民广场',
  '南京东路',
  '陆家嘴',
  '东昌路',
  '世纪大道',
  '上海科技馆',
  '世纪公园',
  '龙阳路',
  '张江高科',
  '金科路',
  '广兰路',
  '唐镇',
  '创新中路',
  '华夏东路',
  '川沙',
  '凌空路',
  '远东大道',
  '海天三路',
  '浦东国际机场'],
 '上海地铁3号线': ['上海南站',
  '石龙路',
  '龙漕路',
  '漕溪路',
  '宜山路',
  '虹桥路',
  '延安西路',
  '中山公园',
  '金沙江路',
  '曹杨路',
  '镇坪路',
  '中潭路',
  '上海火车站',
  '宝山路',
  '东宝兴路',
  '虹口足球场',
  '赤峰路',
  '大柏树',
  '江湾镇',
  '殷高西路',
  '长江南路',
  '淞发路',
  '张华浜',
  '淞滨路',
  '水产路',
  '宝杨路',
  '友谊路',
  '铁力路',
  '江杨北路'],
 '上海地铁4号线': ['宜山路',
  '虹桥路',
  '延安西路',
  '中山公园',
  '金沙江路',
  '曹杨路',
  '镇坪路',
  '中潭路',
  '上海火车站',
  '宝山路',
  '海伦路',
  '临平路',
  '大连路',
  '杨树浦路',
  '浦东大道',
  '世纪大道',
  '浦电路',
  '蓝村路',
  '塘桥',
  '南浦大桥',
  '西藏南路',
  '鲁班路',
  '大木桥路',
  '东安路',
  '上海体育场',
  '上海体育馆'],
 '上海地铁5号线': ['莘庄',
  '春申路',
  '银都路',
  '颛桥',
  '北桥',
  '剑川路',
  '东川路',
  '江川路',
  '西渡',
  '肖塘',
  '奉浦大道',
  '环城东路',
  '望园路',
  '金海湖',
  '奉贤新城'],
 '上海地铁5号线支线': ['东川路', '金平路', '华宁路', '文井路', '闵行开发区'],
 '上海地铁6号线': ['港城路',
  '外高桥保税区北',
  '航津路',
  '外高桥保税区南',
  '洲海路',
  '五洲大道',
  '东靖路',
  '巨峰路',
  '五莲路',
  '博兴路',
  '金桥路',
  '云山路',
  '德平路',
  '北洋泾路',
  '民生路',
  '源深体育中心',
  '世纪大道',
  '浦电路',
  '蓝村路',
  '上海儿童医学中心',
  '临沂新村',
  '高科西路',
  '东明路',
  '高青路',
  '华夏西路',
  '上南路',
  '灵岩南路',
  '东方体育中心'],
 '上海地铁7号线': ['花木路',
  '龙阳路',
  '芳华路',
  '锦绣路',
  '杨高南路',
  '高科西路',
  '云台路',
  '耀华路',
  '长清路',
  '后滩',
  '龙华中路',
  '东安路',
  '肇嘉浜路',
  '常熟路',
  '静安寺',
  '昌平路',
  '长寿路',
  '镇坪路',
  '岚皋路',
  '新村路',
  '大华三路',
  '行知路',
  '大场镇',
  '场中路',
  '上大路',
  '南陈路',
  '上海大学',
  '祁华路',
  '顾村公园',
  '刘行',
  '潘广路',
  '罗南新村',
  '美兰湖'],
 '上海地铁8号线': ['沈杜公路',
  '联航路',
  '江月路',
  '浦江镇',
  '芦恒路',
  '凌兆新村',
  '东方体育中心',
  '杨思',
  '成山路',
  '耀华路',
  '中华艺术宫',
  '西藏南路',
  '陆家浜路',
  '老西门',
  '大世界',
  '人民广场',
  '曲阜路',
  '中兴路',
  '西藏北路',
  '虹口足球场',
  '曲阳路',
  '四平路',
  '鞍山新村',
  '江浦路',
  '黄兴路',
  '延吉中路',
  '黄兴公园',
  '翔殷路',
  '嫩江路',
  '市光路'],
 '上海地铁9号线': ['曹路',
  '民雷路',
  '顾唐路',
  '金海路',
  '金吉路',
  '金桥',
  '台儿庄路',
  '蓝天路',
  '芳甸路',
  '杨高中路',
  '世纪大道',
  '商城路',
  '小南门',
  '陆家浜路',
  '马当路',
  '打浦桥',
  '嘉善路',
  '肇嘉浜路',
  '徐家汇',
  '宜山路',
  '桂林路',
  '漕河泾开发区',
  '合川路',
  '星中路',
  '七宝',
  '中春路',
  '九亭',
  '泗泾',
  '佘山',
  '洞泾',
  '松江大学城',
  '松江新城',
  '松江体育中心',
  '醉白池',
  '松江南站'],
 '上海地铁10号线': ['新江湾城',
  '殷高东路',
  '三门路',
  '江湾体育场',
  '五角场',
  '国权路',
  '同济大学',
  '四平路',
  '邮电新村',
  '海伦路',
  '四川北路',
  '天潼路',
  '南京东路',
  '豫园',
  '老西门',
  '新天地',
  '陕西南路',
  '上海图书馆',
  '交通大学',
  '虹桥路',
  '宋园路',
  '伊犁路',
  '水城路',
  '龙溪路',
  '上海动物园',
  '虹桥1号航站楼',
  '虹桥2号航站楼',
  '虹桥火车站'],
 '上海地铁10号线支线': ['新江湾城',
  '殷高东路',
  '三门路',
  '江湾体育场',
  '五角场',
  '国权路',
  '同济大学',
  '四平路',
  '邮电新村',
  '海伦路',
  '四川北路',
  '天潼路',
  '南京东路',
  '豫园',
  '老西门',
  '新天地',
  '陕西南路',
  '上海图书馆',
  '交通大学',
  '虹桥路',
  '宋园路',
  '伊犁路',
  '水城路',
  '龙溪路',
  '龙柏新村',
  '紫藤路',
  '航中路'],
 '上海地铁11号线': ['康新公路',
  '秀沿路',
  '罗山路',
  '御桥',
  '三林东',
  '浦三路',
  '三林',
  '东方体育中心',
  '云锦路',
  '龙华',
  '龙耀路',
  '上海游泳馆',
  '交通大学',
  '徐家汇',
  '江苏路',
  '隆德路',
  '曹杨路',
  '枫桥路',
  '真如',
  '上海西站',
  '李子园',
  '祁连山路',
  '武威路',
  '桃浦新村',
  '南翔',
  '马陆',
  '嘉定新城',
  '白银路',
  '嘉定西',
  '嘉定北'],
 '上海地铁11号线支线': ['罗山路',
  '御桥',
  '浦三路',
  '三林东',
  '三林',
  '东方体育中心',
  '龙耀路',
  '云锦路',
  '龙华',
  '上海游泳馆',
  '徐家汇',
  '交通大学',
  '江苏路',
  '隆德路',
  '曹杨路',
  '枫桥路',
  '真如',
  '上海西站',
  '李子园',
  '祁连山路',
  '武威路',
  '桃浦新村',
  '南翔',
  '马陆',
  '嘉定新城',
  '上海赛车场',
  '昌吉东路',
  '上海汽车城',
  '安亭',
  '兆丰路',
  '光明路',
  '花桥'],
 '上海地铁12号线': ['金海路',
  '申江路',
  '金京路',
  '杨高北路',
  '巨峰路',
  '东陆路',
  '复兴岛',
  '爱国路',
  '隆昌路',
  '宁国路',
  '江浦公园',
  '大连路',
  '提篮桥',
  '国际客运中心',
  '天潼路',
  '曲阜路',
  '汉中路',
  '南京西路',
  '陕西南路',
  '嘉善路',
  '大木桥路',
  '龙华中路',
  '龙华',
  '龙漕路',
  '漕宝路',
  '桂林公园',
  '虹漕路',
  '虹梅路',
  '东兰路',
  '顾戴路',
  '虹莘路',
  '七莘路'],
 '上海地铁13号线': ['金运路',
  '金沙江西路',
  '丰庄',
  '祁连山南路',
  '真北路',
  '大渡河路',
  '金沙江路',
  '隆德路',
  '武宁路',
  '长寿路',
  '江宁路',
  '汉中路',
  '自然博物馆',
  '南京西路',
  '淮海中路',
  '新天地',
  '马当路',
  '世博会博物馆',
  '世博大道',
  '长清路',
  '成山路',
  '东明路',
  '华鹏路',
  '下南路',
  '北蔡',
  '陈春路',
  '莲溪路',
  '华夏中路',
  '中科路',
  '学林路',
  '张江路'],
 '上海地铁16号线': ['龙阳路',
  '华夏中路',
  '罗山路',
  '周浦东',
  '鹤沙航城',
  '航头东',
  '新场',
  '野生动物园',
  '惠南',
  '惠南东',
  '书院',
  '临港大道',
  '滴水湖'],
 '上海地铁磁悬浮': ['龙阳路', '浦东国际机场'],
 '上海地铁17号线': ['虹桥火车站',
  '褚光路',
  '蟠龙路',
  '徐盈路',
  '徐泾北城',
  '嘉松中路',
  '赵巷',
  '汇金路',
  '青浦新城',
  '漕盈路',
  '淀山湖大道',
  '朱家角',
  '东方绿舟'],
  '上海地铁浦江线':['沈度公路', '三鲁公路', '闵瑞路', '浦航路', '东城一路','汇臻路']}


# st = """
# 上海地铁1号线
# 富锦路
# 友谊西路
# 宝安公路
# 共富新村
# 呼兰路
# 通河新村
# 共康路
# 彭浦新村
# 汶水路
# 上海马戏城
# 延长路
# 中山北路
# 上海火车站
# 汉中路
# 新闸路
# 人民广场
# 黄陂南路
# 陕西南路
# 常熟路
# 衡山路
# 徐家汇
# 上海体育馆
# 漕宝路
# 上海南站
# 锦江乐园
# 莲花路
# 外环路
# 莘庄
# 上海地铁2号线
# 徐泾东
# 虹桥火车站
# 虹桥2号航站楼
# 淞虹路
# 北新泾
# 威宁路
# 娄山关路
# 中山公园
# 江苏路
# 静安寺
# 南京西路
# 人民广场
# 南京东路
# 陆家嘴
# 东昌路
# 世纪大道
# 上海科技馆
# 世纪公园
# 龙阳路
# 张江高科
# 金科路
# 广兰路
# 唐镇
# 创新中路
# 华夏东路
# 川沙
# 凌空路
# 远东大道
# 海天三路
# 浦东国际机场
# 上海地铁3号线
# 上海南站
# 石龙路
# 龙漕路
# 漕溪路
# 宜山路
# 虹桥路
# 延安西路
# 中山公园
# 金沙江路
# 曹杨路
# 镇坪路
# 中潭路
# 上海火车站
# 宝山路
# 东宝兴路
# 虹口足球场
# 赤峰路
# 大柏树
# 江湾镇
# 殷高西路
# 长江南路
# 淞发路
# 张华浜
# 淞滨路
# 水产路
# 宝杨路
# 友谊路
# 铁力路
# 江杨北路
# 上海地铁4号线
# 宜山路
# 虹桥路
# 延安西路
# 中山公园
# 金沙江路
# 曹杨路
# 镇坪路
# 中潭路
# 上海火车站
# 宝山路
# 海伦路
# 临平路
# 大连路
# 杨树浦路
# 浦东大道
# 世纪大道
# 浦电路
# 蓝村路
# 塘桥
# 南浦大桥
# 西藏南路
# 鲁班路
# 大木桥路
# 东安路
# 上海体育场
# 上海体育馆
# 上海地铁5号线
# 莘庄
# 春申路
# 银都路
# 颛桥
# 北桥
# 剑川路
# 东川路
# 江川路
# 西渡
# 肖塘
# 奉浦大道
# 环城东路
# 望园路
# 金海湖
# 奉贤新城
# 上海地铁5号线支线
# 东川路
# 金平路
# 华宁路
# 文井路
# 闵行开发区
# 上海地铁6号线
# 港城路
# 外高桥保税区北
# 航津路
# 外高桥保税区南
# 洲海路
# 五洲大道
# 东靖路
# 巨峰路
# 五莲路
# 博兴路
# 金桥路
# 云山路
# 德平路
# 北洋泾路
# 民生路
# 源深体育中心
# 世纪大道
# 浦电路
# 蓝村路
# 上海儿童医学中心
# 临沂新村
# 高科西路
# 东明路
# 高青路
# 华夏西路
# 上南路
# 灵岩南路
# 东方体育中心
# 上海地铁7号线
# 花木路
# 龙阳路
# 芳华路
# 锦绣路
# 杨高南路
# 高科西路
# 云台路
# 耀华路
# 长清路
# 后滩
# 龙华中路
# 东安路
# 肇嘉浜路
# 常熟路
# 静安寺
# 昌平路
# 长寿路
# 镇坪路
# 岚皋路
# 新村路
# 大华三路
# 行知路
# 大场镇
# 场中路
# 上大路
# 南陈路
# 上海大学
# 祁华路
# 顾村公园
# 刘行
# 潘广路
# 罗南新村
# 美兰湖
# 上海地铁8号线
# 沈杜公路
# 联航路
# 江月路
# 浦江镇
# 芦恒路
# 凌兆新村
# 东方体育中心
# 杨思
# 成山路
# 耀华路
# 中华艺术宫
# 西藏南路
# 陆家浜路
# 老西门
# 大世界
# 人民广场
# 曲阜路
# 中兴路
# 西藏北路
# 虹口足球场
# 曲阳路
# 四平路
# 鞍山新村
# 江浦路
# 黄兴路
# 延吉中路
# 黄兴公园
# 翔殷路
# 嫩江路
# 市光路
# 上海地铁9号线
# 曹路
# 民雷路
# 顾唐路
# 金海路
# 金吉路
# 金桥
# 台儿庄路
# 蓝天路
# 芳甸路
# 杨高中路
# 世纪大道
# 商城路
# 小南门
# 陆家浜路
# 马当路
# 打浦桥
# 嘉善路
# 肇嘉浜路
# 徐家汇
# 宜山路
# 桂林路
# 漕河泾开发区
# 合川路
# 星中路
# 七宝
# 中春路
# 九亭
# 泗泾
# 佘山
# 洞泾
# 松江大学城
# 松江新城
# 松江体育中心
# 醉白池
# 松江南站
# 上海地铁10号线
# 新江湾城
# 殷高东路
# 三门路
# 江湾体育场
# 五角场
# 国权路
# 同济大学
# 四平路
# 邮电新村
# 海伦路
# 四川北路
# 天潼路
# 南京东路
# 豫园
# 老西门
# 新天地
# 陕西南路
# 上海图书馆
# 交通大学
# 虹桥路
# 宋园路
# 伊犁路
# 水城路
# 龙溪路
# 上海动物园
# 虹桥1号航站楼
# 虹桥2号航站楼
# 虹桥火车站
# 上海地铁10号线支线
# 新江湾城
# 殷高东路
# 三门路
# 江湾体育场
# 五角场
# 国权路
# 同济大学
# 四平路
# 邮电新村
# 海伦路
# 四川北路
# 天潼路
# 南京东路
# 豫园
# 老西门
# 新天地
# 陕西南路
# 上海图书馆
# 交通大学
# 虹桥路
# 宋园路
# 伊犁路
# 水城路
# 龙溪路
# 龙柏新村
# 紫藤路
# 航中路
# 上海地铁11号线
# 康新公路
# 秀沿路
# 罗山路
# 御桥
# 三林东
# 浦三路
# 三林
# 东方体育中心
# 云锦路
# 龙华
# 龙耀路
# 上海游泳馆
# 交通大学
# 徐家汇
# 江苏路
# 隆德路
# 曹杨路
# 枫桥路
# 真如
# 上海西站
# 李子园
# 祁连山路
# 武威路
# 桃浦新村
# 南翔
# 马陆
# 嘉定新城
# 白银路
# 嘉定西
# 嘉定北
# 上海地铁11号线支线
# 罗山路
# 御桥
# 浦三路
# 三林东
# 三林
# 东方体育中心
# 龙耀路
# 云锦路
# 龙华
# 上海游泳馆
# 徐家汇
# 交通大学
# 江苏路
# 隆德路
# 曹杨路
# 枫桥路
# 真如
# 上海西站
# 李子园
# 祁连山路
# 武威路
# 桃浦新村
# 南翔
# 马陆
# 嘉定新城
# 上海赛车场
# 昌吉东路
# 上海汽车城
# 安亭
# 兆丰路
# 光明路
# 花桥
# 上海地铁12号线
# 金海路
# 申江路
# 金京路
# 杨高北路
# 巨峰路
# 东陆路
# 复兴岛
# 爱国路
# 隆昌路
# 宁国路
# 江浦公园
# 大连路
# 提篮桥
# 国际客运中心
# 天潼路
# 曲阜路
# 汉中路
# 南京西路
# 陕西南路
# 嘉善路
# 大木桥路
# 龙华中路
# 龙华
# 龙漕路
# 漕宝路
# 桂林公园
# 虹漕路
# 虹梅路
# 东兰路
# 顾戴路
# 虹莘路
# 七莘路
# 上海地铁13号线
# 金运路
# 金沙江西路
# 丰庄
# 祁连山南路
# 真北路
# 大渡河路
# 金沙江路
# 隆德路
# 武宁路
# 长寿路
# 江宁路
# 汉中路
# 自然博物馆
# 南京西路
# 淮海中路
# 新天地
# 马当路
# 世博会博物馆
# 世博大道
# 长清路
# 成山路
# 东明路
# 华鹏路
# 下南路
# 北蔡
# 陈春路
# 莲溪路
# 华夏中路
# 中科路
# 学林路
# 张江路
# 上海地铁16号线
# 龙阳路
# 华夏中路
# 罗山路
# 周浦东
# 鹤沙航城
# 航头东
# 新场
# 野生动物园
# 惠南
# 惠南东
# 书院
# 临港大道
# 滴水湖
# 上海地铁磁悬浮
# 龙阳路
# 浦东国际机场
# 上海地铁17号线
# 虹桥火车站
# 褚光路
# 蟠龙路
# 徐盈路
# 徐泾北城
# 嘉松中路
# 赵巷
# 汇金路
# 青浦新城
# 漕盈路
# 淀山湖大道
# 朱家角
# 东方绿舟
# 上海地铁浦江线
# 沈度公路
# 三鲁公路
# 闵瑞路
# 浦航路
# 东城一路
# 汇臻路
# """
# st = st.strip().split('\n')
# dic = dict()
# key = ''
# for it in st:
#     if it.find('上海地铁') != -1:
#         key = it
#         dic[key] = list()
#     else:
#         dic[key].append(it)
# dic



